app/controllers/sessions_controller.rb

  def create
    user = User.find_or_create_by(id: auth['uid']) do |u|
---
INSERT INTO "users" ("uid", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uid", 10154749656329063], ["name", "Hafizur Rahman"], ["email", "hafiz_sh@yahoo.com"], ["created_at", "2016-10-04 17:37:42.134139"], ["updated_at", "2016-10-04 17:37:42.134139"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1]]